In [1]:
import numpy as np

In [3]:
import pandas as pd

In [7]:
labels =['a','b','c']

In [9]:
my_data = [10,20,30]

In [11]:
arr = np.array(my_data)

In [13]:
d = {'a':10, 'b':20, 'c':30}

In [15]:
d

{'a': 10, 'b': 20, 'c': 30}

In [17]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [19]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [21]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [23]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [27]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [29]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [37]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [41]:
ser1 = pd.Series([1,2,3,4],['USA', 'GERMANY','USSR','Japan'])

In [43]:
ser1

USA        1
GERMANY    2
USSR       3
Japan      4
dtype: int64

In [45]:
ser2 =pd.Series([1,2,3,4,],['USA', 'GERMANY','Italy','Japan'])

In [47]:
ser2

USA        1
GERMANY    2
Italy      3
Japan      4
dtype: int64

In [49]:
ser1['USA']

1

In [51]:
ser3 =pd.Series(data=labels)

In [53]:
ser3

0    a
1    b
2    c
dtype: object

In [55]:
ser3[0]

'a'

In [57]:
ser1 +ser2

GERMANY    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [59]:
ser2

USA        1
GERMANY    2
Italy      3
Japan      4
dtype: int64

In [61]:
from numpy.random import randn

In [65]:
np.random.seed(101)

In [79]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [81]:
df

          W         X         Y         Z
A -0.925874  1.862864 -1.133817  0.610478
B  0.386030  2.084019 -0.376519  0.230336
C  0.681209  1.035125 -0.031160  1.939932
D -1.005187 -0.741790  0.187125 -0.732845
E -1.382920  1.482495  0.961458 -2.141212

In [83]:
df['W']

A   -0.925874
B    0.386030
C    0.681209
D   -1.005187
E   -1.382920
Name: W, dtype: float64

In [85]:
type(df['W'])

pandas.core.series.Series

In [87]:
df.W

A   -0.925874
B    0.386030
C    0.681209
D   -1.005187
E   -1.382920
Name: W, dtype: float64

In [89]:
df[['W','Z']]

          W         Z
A -0.925874  0.610478
B  0.386030  0.230336
C  0.681209  1.939932
D -1.005187 -0.732845
E -1.382920 -2.141212

In [95]:
df['new'] = df ['W'] + df['Y']

In [97]:
df['new']

A   -2.059691
B    0.009512
C    0.650049
D   -0.818062
E   -0.421462
Name: new, dtype: float64

In [99]:
df

          W         X         Y         Z       new
A -0.925874  1.862864 -1.133817  0.610478 -2.059691
B  0.386030  2.084019 -0.376519  0.230336  0.009512
C  0.681209  1.035125 -0.031160  1.939932  0.650049
D -1.005187 -0.741790  0.187125 -0.732845 -0.818062
E -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [103]:
df.drop('new',axis=1)

          W         X         Y         Z
A -0.925874  1.862864 -1.133817  0.610478
B  0.386030  2.084019 -0.376519  0.230336
C  0.681209  1.035125 -0.031160  1.939932
D -1.005187 -0.741790  0.187125 -0.732845
E -1.382920  1.482495  0.961458 -2.141212

In [105]:
df

          W         X         Y         Z       new
A -0.925874  1.862864 -1.133817  0.610478 -2.059691
B  0.386030  2.084019 -0.376519  0.230336  0.009512
C  0.681209  1.035125 -0.031160  1.939932  0.650049
D -1.005187 -0.741790  0.187125 -0.732845 -0.818062
E -1.382920  1.482495  0.961458 -2.141212 -0.421462

In [107]:
df.drop('new',axis=1,inplace=True)

In [109]:
df

          W         X         Y         Z
A -0.925874  1.862864 -1.133817  0.610478
B  0.386030  2.084019 -0.376519  0.230336
C  0.681209  1.035125 -0.031160  1.939932
D -1.005187 -0.741790  0.187125 -0.732845
E -1.382920  1.482495  0.961458 -2.141212

In [111]:
df.drop('E')

          W         X         Y         Z
A -0.925874  1.862864 -1.133817  0.610478
B  0.386030  2.084019 -0.376519  0.230336
C  0.681209  1.035125 -0.031160  1.939932
D -1.005187 -0.741790  0.187125 -0.732845

In [113]:
df

          W         X         Y         Z
A -0.925874  1.862864 -1.133817  0.610478
B  0.386030  2.084019 -0.376519  0.230336
C  0.681209  1.035125 -0.031160  1.939932
D -1.005187 -0.741790  0.187125 -0.732845
E -1.382920  1.482495  0.961458 -2.141212

In [115]:
df.shape

(5, 4)

In [119]:
df.loc['A']

W   -0.925874
X    1.862864
Y   -1.133817
Z    0.610478
Name: A, dtype: float64

In [121]:
df.iloc[2]

W    0.681209
X    1.035125
Y   -0.031160
Z    1.939932
Name: C, dtype: float64

In [123]:
df.loc['B','Y']

-0.37651867524923904

In [129]:
df.loc[['A','B'],['W','Y']]

          W         Y
A -0.925874 -1.133817
B  0.386030 -0.376519

In [131]:
df >0

       W      X      Y      Z
A  False   True  False   True
B   True   True  False   True
C   True   True  False   True
D  False  False   True  False
E  False   True   True  False

In [133]:
booldf = df>0

In [135]:
booldf

       W      X      Y      Z
A  False   True  False   True
B   True   True  False   True
C   True   True  False   True
D  False  False   True  False
E  False   True   True  False

In [137]:
df[booldf]

          W         X         Y         Z
A       NaN  1.862864       NaN  0.610478
B  0.386030  2.084019       NaN  0.230336
C  0.681209  1.035125       NaN  1.939932
D       NaN       NaN  0.187125       NaN
E       NaN  1.482495  0.961458       NaN

In [139]:
df[df>0]

          W         X         Y         Z
A       NaN  1.862864       NaN  0.610478
B  0.386030  2.084019       NaN  0.230336
C  0.681209  1.035125       NaN  1.939932
D       NaN       NaN  0.187125       NaN
E       NaN  1.482495  0.961458       NaN

In [145]:
df['W']> 0

A    False
B     True
C     True
D    False
E    False
Name: W, dtype: bool

In [147]:
df[df['W']>0]

          W         X         Y         Z
B  0.386030  2.084019 -0.376519  0.230336
C  0.681209  1.035125 -0.031160  1.939932

In [149]:
df[df['Z']<0]

          W         X         Y         Z
D -1.005187 -0.741790  0.187125 -0.732845
E -1.382920  1.482495  0.961458 -2.141212

In [151]:
resultdf = df[df['W']>0]

In [153]:
resultdf['X']

B    2.084019
C    1.035125
Name: X, dtype: float64

In [155]:
df[df['W']>0]['X']

B    2.084019
C    1.035125
Name: X, dtype: float64

In [161]:
df[df['W']>0][['X','Y']]

          X         Y
B  2.084019 -0.376519
C  1.035125 -0.031160

In [167]:
df[(df['W']>0) & (df['Z']>1)]

          W         X        Y         Z
C  0.681209  1.035125 -0.03116  1.939932

In [169]:
df[(df['W']>0)|(df['Z']<0)]

          W         X         Y         Z
B  0.386030  2.084019 -0.376519  0.230336
C  0.681209  1.035125 -0.031160  1.939932
D -1.005187 -0.741790  0.187125 -0.732845
E -1.382920  1.482495  0.961458 -2.141212

In [171]:
df

          W         X         Y         Z
A -0.925874  1.862864 -1.133817  0.610478
B  0.386030  2.084019 -0.376519  0.230336
C  0.681209  1.035125 -0.031160  1.939932
D -1.005187 -0.741790  0.187125 -0.732845
E -1.382920  1.482495  0.961458 -2.141212

In [173]:
df.reset_index()

  index         W         X         Y         Z
0     A -0.925874  1.862864 -1.133817  0.610478
1     B  0.386030  2.084019 -0.376519  0.230336
2     C  0.681209  1.035125 -0.031160  1.939932
3     D -1.005187 -0.741790  0.187125 -0.732845
4     E -1.382920  1.482495  0.961458 -2.141212

In [175]:
newind = 'CA NY WY OR CO'.split()

In [177]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [179]:
df['States']=newind

In [181]:
df

          W         X         Y         Z States
A -0.925874  1.862864 -1.133817  0.610478     CA
B  0.386030  2.084019 -0.376519  0.230336     NY
C  0.681209  1.035125 -0.031160  1.939932     WY
D -1.005187 -0.741790  0.187125 -0.732845     OR
E -1.382920  1.482495  0.961458 -2.141212     CO

In [183]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.925874  1.862864 -1.133817  0.610478
NY      0.386030  2.084019 -0.376519  0.230336
WY      0.681209  1.035125 -0.031160  1.939932
OR     -1.005187 -0.741790  0.187125 -0.732845
CO     -1.382920  1.482495  0.961458 -2.141212

In [185]:
df

          W         X         Y         Z States
A -0.925874  1.862864 -1.133817  0.610478     CA
B  0.386030  2.084019 -0.376519  0.230336     NY
C  0.681209  1.035125 -0.031160  1.939932     WY
D -1.005187 -0.741790  0.187125 -0.732845     OR
E -1.382920  1.482495  0.961458 -2.141212     CO

In [187]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [189]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [191]:
insiade

NameError: name 'insiade' is not defined

In [193]:
inside

[1, 2, 3, 1, 2, 3]

In [195]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [197]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [201]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [203]:
df

             A         B
G1 1  0.992573  1.192241
   2 -1.046780  1.292765
   3 -1.467514 -0.494095
G2 1 -0.162535  0.485809
   2  0.392489  0.221491
   3 -0.855196  1.541990

In [205]:
df.loc['G1']

          A         B
1  0.992573  1.192241
2 -1.046780  1.292765
3 -1.467514 -0.494095

In [207]:
df.loc['G1'].loc[1]

A    0.992573
B    1.192241
Name: 1, dtype: float64

In [209]:
df.index.names

FrozenList([None, None])

In [215]:
df.index.names = ['Groups','Num']

In [217]:
df

                   A         B
Groups Num
G1     1    0.992573  1.192241
       2   -1.046780  1.292765
       3   -1.467514 -0.494095
G2     1   -0.162535  0.485809
       2    0.392489  0.221491
       3   -0.855196  1.541990

In [223]:
df.loc['G2'].loc[2]['B']

0.22149068500354543

In [225]:
df.loc['G1']

            A         B
Num
1    0.992573  1.192241
2   -1.046780  1.292765
3   -1.467514 -0.494095

In [229]:
df.xs('G1')

            A         B
Num
1    0.992573  1.192241
2   -1.046780  1.292765
3   -1.467514 -0.494095

In [231]:
df

                   A         B
Groups Num
G1     1    0.992573  1.192241
       2   -1.046780  1.292765
       3   -1.467514 -0.494095
G2     1   -0.162535  0.485809
       2    0.392489  0.221491
       3   -0.855196  1.541990

In [233]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.992573  1.192241
G2     -0.162535  0.485809

In [235]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [237]:
df = pd.DataFrame(d)

In [239]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [241]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [243]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [245]:
df.dropna(axis=1,thresh=2)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [247]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [253]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [255]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [257]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [259]:
df=pd.DataFrame(data)

In [261]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [265]:
df.groupby('Company')

In [275]:
byComp=df.groupby('Company')

In [279]:
byComp

In [291]:
byComp.sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [295]:
byComp.sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [299]:
df.groupby('Company').sum().loc['FB']

Person    CarlSarah
Sales           593
Name: FB, dtype: object

In [301]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [303]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [305]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [307]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [309]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [311]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [313]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [315]:
df['col2'].nunique()

3

In [317]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [319]:
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [321]:
def times2(x):
    return x**2

In [323]:
df['col1'].sum()

10

In [325]:
df['col1'].apply(times2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [329]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [331]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [333]:
df.drop('col1',axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [337]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [339]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [341]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [343]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [345]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [347]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [349]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [351]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [355]:
df.pivot_table(values='D',index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [357]:
pwd

'C:\\Users\\kpullagu\\Documents\\Udemy-PythonForDataScienceandMLCourse\\Py-DS-ML-Bootcamp-master\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

In [359]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [363]:
df=pd.read_csv('example')

In [365]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [367]:
df.to_csv('My_Output',index=False)

In [369]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [389]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1', index_col=None)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [393]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [395]:
data = pd.read_html('https://www.fdic.gov/bank-failures/failed-bank-list')

In [397]:
data

[                               Bank Name               City          State  \
 0  Republic First Bank dba Republic Bank       Philadelphia   Pennsylvania
 1                          Citizens Bank           Sac City           Iowa
 2               Heartland Tri-State Bank            Elkhart         Kansas
 3                    First Republic Bank      San Francisco     California
 4                         Signature Bank           New York       New York
 5                    Silicon Valley Bank        Santa Clara     California
 6                      Almena State Bank             Almena         Kansas
 7             First City Bank of Florida  Fort Walton Beach        Florida
 8                   The First State Bank      Barboursville  West Virginia
 9                     Ericson State Bank            Ericson       Nebraska

     Cert                 Aquiring Institution       Closing Date   Fund
 0  27332    Fulton Bank, National Association     April 26, 2024  10546
 1   8758            Iowa Trust & Savings Bank   November 3, 2023  10545
 2  25851               Dream First Bank, N.A.      July 28, 2023  10544
 3  59017            JPMorgan Chase Bank, N.A.        May 1, 2023  10543
 4  57053                  Flagstar Bank, N.A.     March 12, 2023  10540
 5  24735  First Citizens Bank & Trust Company     March 10, 2023  10539
 6  15426                          Equity Bank   October 23, 2020  10538
 7  16748            United Fidelity Bank, fsb   October 16, 2020  10537
 8  14361                       MVB Bank, Inc.      April 3, 2020  10536
 9  18265           Farmers and Merchants Bank  February 14, 2020  10535  ]

In [399]:
type(data)

list

In [401]:
data[0]

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
5,Silicon Valley Bank,Santa Clara,California,24735,First Citizens Bank & Trust Company,"March 10, 2023",10539
6,Almena State Bank,Almena,Kansas,15426,Equity Bank,"October 23, 2020",10538
7,First City Bank of Florida,Fort Walton Beach,Florida,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
8,The First State Bank,Barboursville,West Virginia,14361,"MVB Bank, Inc.","April 3, 2020",10536
9,Ericson State Bank,Ericson,Nebraska,18265,Farmers and Merchants Bank,"February 14, 2020",10535

In [403]:
from sqlalchemy import create_engine

In [407]:
engine = create_engine('sqlite///:memory:')

ArgumentError: Could not parse SQLAlchemy URL from string 'sqlite///:memory:'